app/controllers/api/v1/comments_controller.rb

INSERT INTO "comments" ("user_id", "post_id", "content", "like_count", "dislike_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 1], ["post_id", 27], ["content", "d"], ["like_count", 0], ["dislike_count", 0], ["created_at", "2024-01-02 01:18:09.918604"], ["updated_at", "2024-01-02 01:18:09.918604"]]
---
  def create
    puts comment_params
    comment = Comment.create!(comment_params)

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "why u like this hi"], ["updated_at", "2024-01-02 05:18:32.441358"], ["id", 13]]
---
  def update
    update_comment = Comment.find(params[:comment][:id])
    puts update_comment
    update_comment.update(params[:comment].as_json(only: [:content]))

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 12]]
---
  def destroy
    update_comment = Comment.find(params[:comment][:id])
    update_comment.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def authenticate_user
    params.permit(:token, :id, comment:{})
    token = params[:token]
    decoded_token = JWT.decode(token, jwt_key, true, algorithm: 'HS256')

    if decoded_token && decoded_token[0] && decoded_token[0]['user_id']
      @current_user = User.find_by(id: decoded_token[0]['user_id'])

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
---
  def set_comment
    params.permit(:id, :token, comment: {})
    puts "set"
    @comment = Comment.find(params[:id])