app/controllers/api/v1/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    posts = Post.all.order(created_at: :desc)
    posts_with_username = posts.map do |post|
      {post: post, username: User.find_by(id: post.user_id)&.username}

INSERT INTO "posts" ("user_id", "title", "content", "category", "like_count", "dislike_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    puts post_params
    post = Post.create!(post_params)

UPDATE "posts" SET "title" = $1, "content" = $2, "category" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["title", "CRUD is working!!! s"], ["content", "it is finally working s"], ["category", "something s"], ["updated_at", "2024-01-03 01:40:58.381017"], ["id", 30]]
---
  def update
    if @post.update(post_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    user = User.find_by(id: @post["user_id"])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def authenticate_user
    params.permit(:token, :id, post:{})
    token = params[:token]
    decoded_token = JWT.decode(token, jwt_key, true, algorithm: 'HS256')

    if decoded_token && decoded_token[0] && decoded_token[0]['user_id']
      @current_user = User.find_by(id: decoded_token[0]['user_id'])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
---
  def set_post
    params.permit(:id, :token, post: {})
    puts "set"
    @post = Post.find(params[:id])

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" DESC  [["post_id", 27]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_comments
    params.permit(:id, :token, post: {})
    @comments = Comment.where(post_id: params[:id]).order(created_at: :desc)
    @comments_json = @comments.as_json(only: [:id, :content, :created_at, :user_id]).map do |comment|
      user = User.find_by(id: comment["user_id"])