app/controllers/api/v1/posts_controller.rb

  def create
    puts post_params
    post = Post.create!(post_params)

    if post
      # Create associated post rating for the current user
      post_rating = @current_user.post_ratings.create(post: post, rating: 0)
---
INSERT INTO "posts" ("user_id", "title", "content", "category", "like_count", "dislike_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def show
    user = User.find_by(id: @post.user_id)
    ratings = @post.post_ratings.map { |rating| { user_id: rating.user_id, rating: rating.rating } }
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]

  def set_post
    params.permit(:id, :token, post: {})
    puts "set"
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def set_comments
    params.permit(:id, :token, post: {})
    @comments = Comment.where(post_id: params[:id]).order(created_at: :desc)
    @comments_json = @comments.as_json(only: [:id, :content, :created_at, :user_id]).map do |comment|
      user = User.find_by(id: comment["user_id"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]