app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "pengxuan"], ["password_digest", "[FILTERED]"], ["created_at", "2023-12-26 03:18:00.053045"], ["updated_at", "2023-12-26 03:18:00.053045"]]
---
    def create
      user = User.new(user_params)

      if user.save